Repository: quasiyoke/RandTalkBot
Catalog: randtalkbot/locale/*/LC_MESSAGES/randtalkbot.po
Languages: ru

source: Female
ru: Женский

source: Male
ru: Мужской

source: Not specified
ru: Не указано

source: boy
ru: мальчик

source: man
ru: мужчина

source: girl
ru: девочка

source: woman
ru: женщина

source: The search is going on. {0} users are looking for partner -- change your preferences (languages, partner's sex) using /setup command to talk with them. Chat *lacks females!* Send the link to your friends and earn {1} bonuses for every invited female and {2} bonus for each male (the more bonuses you have -- the faster partner's search will be):
ru: Поиск продолжается. Сейчас {0} пользователей ищут партнера, — чтобы поговорить с ними, измените свои предпочтения (языки, пол собеседника) командой /setup. В чате *не хватает девушек!* Отправьте ссылку своим знакомым и получайте по {1} бонуса за приглашенную девушку и по {2} бонусу за мужчину (больше бонусов → быстрее поиск собеседника):

source: The search is going on. {0} users are looking for partner -- change your preferences (languages, partner's sex) using /setup command to talk with them. Chat *lacks males!* Send the link to your friends and earn {1} bonuses for every invited male and {2} bonus for each female (the more bonuses you have -- the faster partner's search will be):
ru: Поиск продолжается. Сейчас {0} пользователей ищут партнера, — чтобы поговорить с ними, измените свои предпочтения (языки, пол собеседника) командой /setup. В чате *не хватает мужчин!* Отправьте ссылку своим знакомым и получайте по {1} бонуса за приглашенного мужчину и по {2} бонусу за девушку (больше бонусов → быстрее поиск собеседника):

source: Do you want to talk with somebody, practice in foreign languages or you just want to have some fun? Rand Talk will help you! It's a bot matching you with a random stranger of desired sex speaking on your language. {0}
ru: Вам[ ](http://randtalk.ml/static/img/logo-125x125.png) нужно общение, хотите отточить иностранный язык или просто повеселиться? На помощь придет Rand Talk — бот для общения со случайными собеседниками заданного пола. [Попробуйте!]({0})

source: Looking for partner was stopped.
ru: Поиск партнера прекращен

source: You've received one bonus for inviting a person to the bot. Bonuses will help you to find partners quickly. Total bonuses count: {0}. Congratulations! To mute this notifications, use /mute\_bonuses.
ru: Вы получили один бонус за то, что привлекли пользователя в Rand Talk. Бонусы помогут вам быстрее находить собеседников. Общее количество бонусов: {0}. Поздравляем! 🤑 Чтобы приостановить эти уведомления, вызовите /mute\_bonuses.

source: You've received {0} bonuses for inviting a person to the bot. Bonuses will help you to find partners quickly. Total bonuses count: {1}. Congratulations! To mute this notifications, use /mute\_bonuses.
ru: Вы получили {0} бонуса за то, что привлекли пользователя в Rand Talk. Бонусы помогут вам быстрее находить собеседников. Общее количество бонусов: {1}. Поздравляем! 🤑 Чтобы приостановить эти уведомления, вызовите /mute\_bonuses.

source: Chat was finished.
ru: Беседа закончена.

source: Your partner has left chat.
ru: Собеседник покинул чат. 😿

source: You've used one bonus. {0} bonus(es) left.
ru: Вы использовали один бонус. {0} бонус(ов) осталось.

source: You've used your last bonus.
ru: Был использован ваш последний бонус.

source: Feel free to /begin a new talk.
ru: Чтобы начать новый разговор, скомандуйте /begin.

source: Use {0} please.
ru: Используйте пожалуйста {0}.

source: You can use the following languages: {0}.
ru: Вы можете использовать следующие языки: {0}.

source: Your partner is here.
ru: Собеседник найден.

source: You've used one bonus with previous partner. {0} bonus(es) left.
ru: Вы использовали один бонус с предыдущим партнером. {0} бонус(ов) осталось.

source: You've used your last bonus with previous partner.
ru: Был использован ваш последний бонус с предыдущим партнером.

source: Here's another stranger.
ru: Подобран новый собеседник.

source: Your partner's been looking for you for {0} hr. Say him "Hello" -- if he doesn't respond to you, launch search again by /begin command.
ru: Партнер ждал вас {0} ч. Поприветствуйте его — если он не ответит, вы можете вновь запустить поиск командой /begin.

source: Your partner's been looking for you for {0} min. Say him "Hello" -- if he doesn't respond to you, launch search again by /begin command.
ru: Партнер ждал вас {0} мин. Поприветствуйте его — если он не ответит, вы можете вновь запустить поиск командой /begin.

source: Have a nice chat!
ru: Приятного общения 🤗

source: Looking for a stranger for you.
ru: Идет подбор партнера 🤔

source: *Help* Use /begin to start looking for a conversational partner, once you're matched you can use /end to finish the conversation. To choose your settings, apply /setup. If you have any suggestions or require help, please contact @quasiyoke. When asking questions, please provide this number: {0}. Subscribe to [our news](https://telegram.me/RandTalkChannel). You're welcome to inspect and improve [Rand Talk v. {1} source code](https://github.com/quasiyoke/RandTalkBot) or to [give us 5 stars](https://telegram.me/storebot?start=randtalkbot).
ru: *Помощь* Чтобы приступить к поиску собеседника, скомандуйте /begin. Когда ваш партнер будет найден, вы сможете закончить разговор, выполнив /end. Если вы хотите изменить настройки бота, примените команду /setup. С предложением по боту или за справкой вы можете обратиться к @quasiyoke. Задавая вопрос, сообщите пожалуйста это число: {0}. Подписывайтесь на [наши новости (en)](https://telegram.me/RandTalkChannel). Мы будем рады вашим дополнениям и замечаниям к [исходным кодам Rand Talk v. {1}](https://github.com/quasiyoke/RandTalkBot) или если вы [дадите нам 5 звезд](https://telegram.me/storebot?start=randtalkbot).

source: Notifications about bonuses were muted for 1 hour
ru: Уведомления о бонусах были приостановлены на 1 час 🤐

source: Don't try to fool me. Forward message with the link to your friends and receive well-earned bonuses that will help you to find partner quickly.
ru: Не пытайтесь меня обмануть. 😉 Разошлите сообщение со ссылкой своим друзьям и вы получите честнозаработанные бонусы, которые помогут вам находить собеседников быстрее.

source: *Manual* Use /begin to start looking for a conversational partner, once you're matched you can use /end to end the conversation.
ru: *Руководство* Чтобы приступить к поиску собеседника, скомандуйте /begin. Когда ваш партнер будет найден, вы сможете закончить разговор, выполнив /end.

source: Messages of this type aren't supported.
ru: Сообщения такого типа не поддерживаются 😞

source: Unknown command. Look /help for the full list of commands.
ru: Неизвестная команда. Чтобы посмотреть все команды, скомандуйте /help.

source: Your partner has blocked me! How did you do that?!
ru: Ваш собеседник меня заблокировал! И как только вам это удается?! 😕

source: Rand Talk Invitation Link
ru: Приглашение в Rand Talk

source: The more friends'll use your link -- the faster the search will be
ru: Чем больше знакомых воспользуются ссылкой, тем быстрее будет поиск

source: Thank you. Use /begin to start looking for a conversational partner, once you're matched you can use /end to end the conversation.
ru: Спасибо за информацию! 😋 Чтобы приступить к поиску собеседника, скомандуйте /begin. Когда ваш партнер будет найден, вы сможете закончить разговор, выполнив /end.

source: Please specify at least one language.
ru: Укажите пожалуйста хоть один язык Please specify at least one language

source: Language "{0}" wasn't found.
ru: Язык «{0}» мне не знаком. 😳 Может, вы ошиблись? Попробуйте ввести название языка по-английски. Language “{0}” wasn't found. Try to specify language in English.

source: Too much languages were specified. Please shorten your list to 6 languages.
ru: Вы указали слишком много языков. Пожалуйста, сократите ваш список до 6 языков. Too much languages were specified. Please shorten your list to 6 languages.

source: Unknown sex: "{0}" -- is not a valid sex name.
ru: Непонятный пол: «{0}». Здесь точно нет никакой ошибки? 😉 Unknown sex: “{0}” — is not a valid sex name. Are you sure you aren't mistaken?

source: Finish setup process please. After that you can start using bot.
ru: Пожалуйста, закончите процесс настройки. После него вы сможете приступить к пользованию ботом.

source: Enumerate the languages you speak like this: "English, Italian" -- in descending order of your speaking convenience or just pick one at special keyboard.
ru: Перечислите языки, которыми вы владеете, в таком формате: «English, Italian» — в порядке убывания уровня ваших знаний или просто выберите ваш язык на специальной «клавиатуре». Enumerate the languages you speak like this: “English, Italian” — in descending order of your speaking convenience or just pick one at special keyboard.

source: Leave the language unchanged
ru: Не менять язык

source: Your current language is {0}. Enumerate the languages you speak like this: "English, Italian" -- in descending order of your speaking convenience or just pick one at special keyboard.
ru: Сейчас установлен {0} язык. Перечислите языки, которыми вы владеете, в таком формате: «English, Italian» — в порядке убывания уровня ваших знаний или просто выберите ваш язык на специальной «клавиатуре». Your current language is {0}. Enumerate the languages you speak like this: “English, Italian” — in descending order of your speaking convenience or just pick one at special keyboard.

source: Leave the languages unchanged
ru: Не менять языки

source: Your current languages are: {0}. Enumerate the languages you speak the same way -- in descending order of your speaking convenience or just pick one at special keyboard.
ru: Сейчас выбраны следующие языки: {0}. Перечислите языки, которыми вы владеете, в таком же формате, в порядке убывания уровня ваших знаний или просто выберите ваш язык на специальной «клавиатуре». Your current languages are: {0}. Enumerate the languages you speak the same way, in descending order of your speaking convenience or just pick one at special keyboard.

source: Set up your sex. If you pick "Not Specified" you can't choose your partner's sex.
ru: Выберите ваш пол. Вы не сможете задать пол собеседника, если нажмете «Не указано».

source: Choose your partner's sex
ru: Выберите пол собеседника
